In [2]:
import pandas as pd

In [3]:
friend_list = [
    ['Bang',22,'student'],
    ['Kim',21,'student'],
    ['Lee',22,'student'],
    ['Lim',21]
    ]

In [4]:
c_name = ['name','age','job']

In [5]:
df = pd.DataFrame.from_records(friend_list,columns= c_name)

In [6]:
# create csv file
    # df.to_csv('friend_list.csv', index = False,na_rep='None')

In [12]:
df2 = df.set_index("name")
df2.iloc[:]

      age      job
name
Bang   22  student
Kim    21  student
Lee    22  student
Lim    21     None

In [10]:
df.loc[[0,1]]

   name  age      job
0  Bang   22  student
1   Kim   21  student

In [11]:
df[df.age>21]

   name  age      job
0  Bang   22  student
2   Lee   22  student

In [12]:
df[(df.age>21) & (df.name == 'Bang')]

   name  age      job
0  Bang   22  student

In [13]:
df.iloc[1:3,0:2]

  name  age
1  Kim   21
2  Lee   22

In [14]:
school_id_list = [{'name' :  'Bang', 'job' : 'student', 'age' : 22},
                 {'name' :  'kim', 'job' : 'student', 'age' : 21},
                 {'name' :  'lee', 'job' : 'student', 'age' : 22},
                 {'name' :  'lim', 'job' : 'student', 'age' : 21},
                 {'name' :  'kim', 'job' : 'professor', 'age' : 39},
                 {'name' :  'kim', 'job' : 'professor'}]
df = pd.DataFrame(school_id_list, columns = ['name','job','age'])

In [15]:
df

   name        job   age
0  Bang    student  22.0
1   kim    student  21.0
2   lee    student  22.0
3   lim    student  21.0
4   kim  professor  39.0
5   kim  professor   NaN

In [16]:
df.shape

(6, 3)

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
name    6 non-null object
job     6 non-null object
age     5 non-null float64
dtypes: float64(1), object(2)
memory usage: 224.0+ bytes

In [18]:
df.isna()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False   True

In [19]:
df.isnull()

    name    job    age
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False
5  False  False   True

In [20]:
df.age = df.age.fillna(0)

In [21]:
df

   name        job   age
0  Bang    student  22.0
1   kim    student  21.0
2   lee    student  22.0
3   lim    student  21.0
4   kim  professor  39.0
5   kim  professor   0.0

In [22]:
school_id_list = [{'name' :  'Bang', 'job' : 'student', 'age' : 22},
                 {'name' :  'kim', 'job' : 'student', 'age' : 21},
                 {'name' :  'lee', 'job' : 'student', 'age' : 22},
                 {'name' :  'lim', 'job' : 'student', 'age' : 21},
                 {'name' :  'kim', 'job' : 'professor', 'age' : 39},
                 {'name' :  'kim', 'job' : 'professor'}]
df = pd.DataFrame(school_id_list, columns = ['name','job','age'])

In [23]:
 df['age'].fillna(df.groupby('job')['age'].transform('median'),inplace = True)

In [24]:
df

   name        job   age
0  Bang    student  22.0
1   kim    student  21.0
2   lee    student  22.0
3   lim    student  21.0
4   kim  professor  39.0
5   kim  professor  39.0

In [38]:
data_list = [{'yyyy-mm-dd': '2000-06-27'},
            {'yyyy-mm-dd': '2002-09-24'},
            {'yyyy-mm-dd': '2005-12-20'}]
df = pd.DataFrame(data_list,columns=['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [39]:
def extract_year(column):
    return column.split("-")[0]

In [42]:
df['year'] = df['yyyy-mm-dd'].apply(extract_year)

In [43]:
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

In [44]:
def get_age(year,current_year):
    return current_year - int(year)

In [45]:
df['age'] = df['year'].apply(get_age,current_year=2018)

In [46]:
df

   yyyy-mm-dd  year  age
0  2000-06-27  2000   18
1  2002-09-24  2002   16
2  2005-12-20  2005   13